In [11]:
# Series index example
import pandas as pd
series = pd.Series([10,12,11,12.5,15], index = list('abcde'))
print(series)

a    10.0
b    12.0
c    11.0
d    12.5
e    15.0
dtype: float64

In [45]:
df = pd.DataFrame([('ravi',10),('shubhansh',29),('Shiv',30)],columns=['Name','Marks'], index = list('123'))
print(df)

        Name  Marks
1       ravi     10
2  shubhansh     29
3       Shiv     30

In [73]:
movies = pd.read_csv(r'E:\SEM II study materials\Advance Python Sem-II\Module 2\Data visulization in python\Pandas\Details.csv')
print(movies.head(2))

   Unnamed: 0          Name  Age   City
0           0  Aman Kushwah   19   Agra
1           1         Saket   23  Delhi

In [21]:
#indexing
data = movies['Name']
print(data,data.dtype)

0    Aman Kushwah
1           Saket
2            Ravi
Name: Name, dtype: object object

In [28]:
data = movies[['Name','Age']]
print(data,type(data))

           Name  Age
0  Aman Kushwah   19
1         Saket   23
2          Ravi   20 <class 'pandas.core.frame.DataFrame'>

In [43]:
data.loc[1]

Name    Saket
Age        23
Name: 1, dtype: object

In [44]:
data.loc[0:1,'Name']

0    Aman Kushwah
1           Saket
Name: Name, dtype: object

In [70]:
movies.loc[:,['Name','Age']]

           Name  Age
0  Aman Kushwah   19
1         Saket   23
2          Ravi   20
3          Shiv   45
4         sumit   34

In [72]:
# data.loc[:,[True, False]]
movies.loc[movies['Age'] > 20,:]

   Unnamed: 0   Name  Age      City
1           1  Saket   23     Delhi
3           3   Shiv   45  Shadabad
4           4  sumit   34    nagpur

In [67]:
import numpy as np
ar = np.array([10,5,3,1,12,8,6])
print(ar<5)
print(ar+5)
print(ar>5)
print(ar == 10)

[False False  True  True False False False]
[15 10  8  6 17 13 11]
[ True False False False  True  True  True]
[ True False False False False False False]

In [74]:
movies.loc[movies['Age'] >18,['Name']]

           Name
0  Aman Kushwah
1         Saket
2          Ravi
3          Shiv
4         sumit